askme/backend/test/load/claps.yml
# Execute with like this:
# artillery run --target  <graphql endpoint> --variables '{"conferenceName":"<conference name to create>"}' test/load/claps.yml

config:
  plugins:
    expect: {}
  phases:
    - duration: 1
      arrivalRate: 100
      name: Clapping questions

scenarios:
  - name: "Clapping questions"
    flow:
      - post:
          name: "Selecting one question randomly"
          url: "/"
          body: '{
            "query":"query {
              ConferenceReadModel(id:\"{{conferenceName}}\") { questions }
            }"
          }'
          capture:
            json: "$.data.ConferenceReadModel.questions[*].id"
            as: "questionId"
      - post:
          name: "Clapping the question"
          url: "/"
          body: '{
            "query":"mutation {
              Clap(input:{
                questionId: \"{{questionId}}\",
                byWhom: \"Bryan Bednarek\"
              })
            }"
          }'
          expect:
            - notHasProperty: errors